app/views/events/index.html.erb

    var endts = end.getTime() * .001;
    jQuery.ajax({
     type : 'GET',
     dataType : 'json',

     data : {
      'dtstart' : startts,
      'dtend' : endts,
      'uid' : '<%= escape_javascript(params[:uid]) %>'
     },
     //url : '/users/:uid/events/get_json',
     url : '/users/<%= escape_javascript(params[:uid]) %>/events/get_json',
     success : function(data, textStatus) {
 //    alert(startts  + " " + endts + " " + data[0]['title']);
      for (i = 0; i < data.length; i++){
       $("#calendar").fullCalendar('renderEvent', data[i]);
      }
     },
     error : function(XMLHttpRequest, textStatus, errorThrown) {
   //   alert("Damn");
     },
     complete : function(XMLHttpRequest, textStatus) {
---
SELECT "events".* FROM "events"