app/controllers/events_controller.rb

  def create
    @event = Event.new(params[:event])
    if User.exists? @event.user_id
      u = User.find @event.user_id
      u.events << @event        # associates to user
---
INSERT INTO "events" ("created_at", "description", "dtend", "dtstart", "summary", "uid", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)